{"items":[{"id":1819160,"creationdate":"2023-12-03T04:22:43.587000+00:00","viewcount":7,"lasteditdate":null,"lastactivitydate":"2023-12-03T04:22:43.587000+00:00","title":"Keyboard not working on khali linux","body":"<p>I have recently installed virtualbox on my windows 10 and trying to run Linux Ubuntu and Kali. Everything working on Ubuntu without any issue but when I am running kali it is not taking keyboard(Samsung bluetooth 500) input. Please can anyone help me out here.\nMany thanks in advance!!</p>\n","answercount":0,"closeddate":null,"tags":["virtual-machine"]},{"id":1819154,"creationdate":"2023-12-03T03:24:20.410000+00:00","viewcount":9,"lasteditdate":null,"lastactivitydate":"2023-12-03T03:24:20.410000+00:00","title":"Motherboard causes Windows boot into INACCESSIBLE BOOT DEVICE","body":"<p>Alternative problem:<br />\nAfter replacing motherboard(MB) or resetting BIOS settings to defaults, Windows boots into INACCESSIBLE BOOT DEVICE (IBD)</p>\n<p>There are tons of IBD questions, but they are mostly about noticeable failures of software or hardware. In this case, no software or hardware malfunction is expected, but BSOD happens.</p>\n<p>Main symptoms, while using same disk with W10:</p>\n<p>On the previous PC/MB (or other hardware):</p>\n<ul>\n<li>Boot from SATA works well</li>\n</ul>\n<p>On the new specific PC/MB:</p>\n<ul>\n<li>SATA boot: ends with IBD BSOD</li>\n<li>USB (SATA to USB direct adapter) boot: OK</li>\n<li>When trying to install W10, SSD or M.2 are not detected (unless drivers are manually provided?)</li>\n<li>Boot with Live USB (Clonezilla or Linux Lite): detects M.2 and SATA disks correctly</li>\n</ul>\n<p>How to fix W10 boot BSOD?</p>\n","answercount":1,"closeddate":null,"tags":["boot","hardware-detection","windows-10"]},{"id":1819142,"creationdate":"2023-12-02T23:21:59.737000+00:00","viewcount":4,"lasteditdate":null,"lastactivitydate":"2023-12-02T23:21:59.737000+00:00","title":"Batch script: going to page marked as variable?","body":"<p>First off, I really doubt that my method of trying to go about this is correct. I'm a huge beginner lol.\nI'm trying to make it where if you input an answer that's incorrect on any section of the program it goes to a preset error/incorrect message and then repeat the question that was asked.\ni.e\n:question\nwhat color is an apple\n(input blue)\n:incorrect\nno\nand then it goes back to :question and repeats\nbut there will be multiple questions</p>\n<p>I tried setting a variable as the section and doing this</p>\n<pre><code>:Pageone\nset pg=Pageone\nset /p ans=whatever the thing is\nif %ans%==good goto Yes\nif %ans%==bad goto no\n\n:Yes\nset pg=Yes\nset /p ans=whatever the thing is\nif %ans%==good goto Whatever\nif %ans%==bad goto no\n\n:no\necho wrong\ngoto pg\n</code></pre>\n<p>There's almost certainly a better way to do this but I'm really not sure. Again, I'm a <em>huge</em> beginner.</p>\n","answercount":0,"closeddate":null,"tags":["windows","batch-file","batch","command-line"]},{"id":1819126,"creationdate":"2023-12-02T20:21:21.507000+00:00","viewcount":6,"lasteditdate":null,"lastactivitydate":"2023-12-02T20:21:21.507000+00:00","title":"Custom Conditional Formatting in Google Sheets - scripts","body":"<p>Quick question: Any tips for applying custom conditional formatting in Google Sheets? I'm trying to highlight cells with values between 50 and 100 using a specific color. The built-in options aren't quite cutting it. Any help or formulas/scripts you've used for this?</p>\n<p>Thanks!</p>\n","answercount":0,"closeddate":"2023-12-02T21:59:16.927000+00:00","tags":["userscripts","google-spreadsheets","conditional-formatting"]},{"id":1819112,"creationdate":"2023-12-02T19:31:13.940000+00:00","viewcount":29,"lasteditdate":"2023-12-02T19:39:38.713000+00:00","lastactivitydate":"2023-12-02T19:52:15.127000+00:00","title":"What is the best program to open a massive tar.gz file with very many subdirectories and small individual files, Win 10","body":"<p>I have downloaded a 67 GB datafile that is a tar.gz file, and have been trying to extract part of it (on Windows 10) using Express Zip. It has been stuck “reading contents” for the last hour and a half. I concluded that it will never progress to the next step, so cancelled whatever it was doing.</p>\n<p>I only know that the file contains a lot of data in individual files – there was no information associated with the file that I could find at <a href=\"https://commonvoice.mozilla.org/en/datasets\" rel=\"nofollow noreferrer\">the source</a>, other than an indication that there are probably up to 114 subdirectories according to language and bazillions of individual files. It is possible that I’m facing a memory limitation, that it cannot extract the internal directory information because TMI. Express Zip doesn't give any unseful indicator that it is doing anything, and after cancelling it gave no information on what it had done.</p>\n<p>Is there an efficient tool that works on Windows, can discover on Windows 10 what is inside of the zip file, and allow me to extract “the Dutch examples” assuming that the Dutch examples are in a single sub-directory containing the word “Dutch”, given the assumption that there are very many files.</p>\n","answercount":0,"closeddate":"2023-12-02T21:19:07.240000+00:00","tags":["gzip","tar","windows-10"]}]}